Расш_ШтрихкодыВЗаказе/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="93716140-4123-4913-8258-75356dec29a0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c79450ab-f8f1-43d9-948d-10c6481c5538">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Расш_ШтрихкодыВЗаказе/src/CommonModules/ШК_РаботаСоШтрихкодами/Module.bsl
Функция ШтрихкодНоменклатуры (Номенклатура, Характеристика, Упаковка)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
		|	И ШтрихкодыНоменклатуры.Характеристика = &Характеристика
		|	И ШтрихкодыНоменклатуры.Упаковка = &Упаковка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Штрихкод";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Упаковка", Упаковка);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	
	ШтрихкодИтого = "";
	Пока Выборка.Следующий() Цикл
		
		ШтрихкодИтого = ШтрихкодИтого + ?(ШтрихкодИтого = "","",Символы.ПС) + Выборка.Штрихкод;
		
	КонецЦикла;
	
	Возврат ШтрихкодИтого;
КонецФункции

Процедура ЗаполнитьШтрихкодыДокумента (Объект, ИмяТЧ, Правильно = Ложь)Экспорт 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Упаковка КАК Упаковка
		|ПОМЕСТИТЬ втТЧТовары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика, ШтрихкодыНоменклатуры.Упаковка) В
		|			(ВЫБРАТЬ
		|				Т.Номенклатура,
		|				Т.Характеристика,
		|				Т.Упаковка
		|			ИЗ
		|				втТЧТовары КАК Т)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Штрихкод
		|ИТОГИ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Упаковка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Товары", Объект[ИмяТЧ].Выгрузить(,"Номенклатура, Характеристика, Упаковка"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
	
		ВыборкаХарактеристика = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаХарактеристика.Следующий() Цикл
	
			ВыборкаУпаковка = ВыборкаХарактеристика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
			Пока ВыборкаУпаковка.Следующий() Цикл
	
				Выборка = ВыборкаУпаковка.Выбрать();
				ШтрихКодИтого = "";
				Пока Выборка.Следующий() Цикл
					ШтрихкодИтого = ШтрихкодИтого + ?(ШтрихкодИтого = "","",Символы.ПС) + Выборка.Штрихкод;	
				КонецЦикла;
				
				ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика, Упаковка");
				ЗаполнитьЗначенияСвойств(ПараметрыОтбора,ВыборкаУпаковка);
				
				НайденныеСтроки = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбора);
				Для Каждого Строка Из НайденныеСтроки Цикл
					Если Правильно Тогда 
						Строка.ШК_ШтрихкодПравильный = ШтрихкодИтого ;
					Иначе
						Строка.ШК_Штрихкод = ШтрихкодИтого;
					КонецЕсли;
				КонецЦикла;
				
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
